demo-soap/request.http

POST http://localhost:3306/ws/countries.wsdl
Content-Type: text/xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://spring.io/guides/gs-producing-web-service"><soapenv:Header/>
    <soapenv:Body>
        <gs:getCountryRequest>
            <gs:name>Viernes</gs:name>
        </gs:getCountryRequest>
    </soapenv:Body>
</soapenv:Envelope>
